목 차

01.동작하는 방식에 따른 서브쿼리 분류

02.반환되는 데이터 형태에 따른 서브쿼리 분류

03.스칼라 서브쿼리

04.뷰

01.동작하는 방식에 따른 서브쿼리 분류

서브쿼리 분류

서브쿼리에 
메인쿼리의 컬럼이 포함되는지에 따라 구분

1.연관 서브쿼리
  (Correlated Subquery)

2.비연관 서브쿼리
  (Un-Correlated Subquery)

연관 서브쿼리

메인 쿼리의 컬럼이 서브쿼리에 포함되며,
메인쿼리의 컬럼은 서브쿼리에 특정 조건으로 사용된다.

연관 서브쿼리

본인이 속한 부서의 평균 급여보다 높은 급여를 받는 직원들을 출력한다.

코드
SELECT ID, DEPARTMENT_ID, NAME, SALARY
FROM EMPLOYEE AS A
WHERE SALARY >
    (SELECT AVG(SALARY)
     FROM EMLOYEE AS B
     WHERE B.DEPARTMENT_ID = A.DEPARTMENT_ID);


EMPLOYEE 
ID            DEPARTMENT_ID     NAME       SALARY
1000                1           ELICE      12000
1001                2           JESSICA     9000
1002                3           STEVE       7500
1003                1           LINDA       5500
1004                2           DAVID       4400
1005                1           ROBERT      3200

DEPARTMENT_ID   AVG(SALARY)
      1          6900
      2          6700
      3          7500

결과
ID            DEPARTMENT_ID     NAME       SALARY
1000                 1          ELICE      12000
1001                 2          JESSICA     9000

비연관 서브쿼리

메인쿼리 컬럼이 서브쿼리에 포함되지 않으며,
주로 메인쿼리에 특정한 값을 제공할 때 사용된다

비연관 서브쿼리

ELICE가 속한 부서의 평균 급여를 출력한다.

코드
SELECT AVG(SALARY)
FROM EMPLOYEE
WHERE DEPARTMENT_ID = (
    SELECT DEPARTMENT_ID
    FROM EMPLOYEE
    WHERE NAME ='ELICE');
    
서브쿼리 값
DEPARTMENT_ID
     1
     
EMPLOYEE
ID            DEPARTMENT_ID     NAME       SALARY
1000                1           ELICE      12000
1001                2           JESSICA     9000
1002                3           STEVE       7500
1003                1           LINDA       5500
1004                2           DAVID       4400
1005                1           ROBERT      3200

AVG_SALARY
 6900

동작하는 방식에 따른 서브쿼리 분류 - 연관 서브쿼리
EMPLOYEE 테이블에는 직원 ID, 관리자 ID, 급여 정보가 담겨 있습니다.

직원들 중에서 자신의 관리자보다 급여가 높거나 같은 직원에 대해서 알아보고자 합니다. EMPLOYEE 테이블에는 직원에 대해 관리자 ID 정보만 있기 때문에, 연관 서브쿼리를 통해 직원의 관리자 급여정보를 추출해야 합니다.

연관 서브쿼리를 이용하여, 자신의 관리자보다 급여가 높거나 같은 직원 ID를 조회하는 쿼리를 작성해 봅시다.

지시사항
직원의 관리자 급여를 추출하는 서브쿼리를 WHERE문 조건에 응용하고 연관 서브쿼리 개념을 이용하여, 직원의 급여가 직원의 관리자 급여보다 높거나 같은 직원 ID(employee_id) 를 조회해 봅시다.

Tip!
결과에 대해 ORDER BY 를 이용하여 직원 ID를 기준으로 오름차순 정렬을 해주세요.

In [ ]:
'''
-- 아래는 EMPLOYEE 테이블에 대한 구조를 보여줍니다. 테이블을 수정하실 필요는 없습니다.
DESC EMPLOYEE;

SELECT * FROM EMPLOYEE;
-- 자신의 관리자의 급여보다 높거나 같은 급여를 가진 직원의 ID를 출력하는 쿼리를 작성해봅시다.

SELECT A.employee_id
FROM EMPLOYEE  A
WHERE A.salary >= (
    SELECT salary
    FROM EMPLOYEE  B
    WHERE A.manager_id = B.employee_id)
ORDER BY employee_id ASC;
'''

'''
+-------------+---------+------+-----+---------+-------+
| Field       | Type    | Null | Key | Default | Extra |
+-------------+---------+------+-----+---------+-------+
| employee_id | int(11) | NO   | PRI | NULL    |       |
| manager_id  | int(11) | YES  |     | NULL    |       |
| salary      | int(11) | NO   |     | NULL    |       |
+-------------+---------+------+-----+---------+-------+
+-------------+------------+--------+
| employee_id | manager_id | salary |
+-------------+------------+--------+
|       10000 |       NULL |   9000 |
|       10001 |       NULL |   8500 |
|       10002 |      10000 |   9000 |
|       10003 |      10002 |   7000 |
|       10004 |      10001 |   9500 |
|       10005 |      10003 |   7500 |
|       10006 |      10003 |   5000 |
+-------------+------------+--------+
+-------------+
| employee_id |
+-------------+
|       10002 |
|       10004 |
|       10005 |
+-------------+
'''

동작하는 방식에 따른 서브쿼리 분류 - 비연관 서브쿼리
EMPLOYEE 테이블에는 직원 ID, 관리자 ID, 급여 정보가 담겨 있습니다.

급여가 8,000미만인 직원을 관리하는 관리자의 ID와 급여를 출력하고자 합니다. EMPLOYEE 테이블에는 관리자의 급여정보가 없기 때문에, 비연관 서브쿼리를 통해 급여가 8,000미만인 직원의 관리자 ID를 조회하고, 해당 ID에 대해 직원 ID와 급여정보를 조회해봅시다.

비연관 서브쿼리를 이용하여, 급여가 8,000 미만인 직원의 관리자 ID와 급여를 출력하는 쿼리를 작성하세요.

지시사항
급여가 8,000 미만인 직원의 관리자 ID 를 추출하는 서브쿼리를 WHERE문 조건에 응용하고 비연관 서브쿼리 개념을 이용하여, 급여가 8,000 미만인 직원의 관리자 ID(employee_id)와 급여(salary) 를 조회해 봅시다.

Tip!
결과에 대해 ORDER BY 를 이용하여 직원 ID를 기준으로 오름차순 정렬을 해주세요.

In [ ]:
'''
-- 아래는 EMPLOYEE 테이블에 대한 구조를 보여줍니다. 테이블을 수정하실 필요는 없습니다.
DESC EMPLOYEE;
SELECT * FROM EMPLOYEE;
-- 급여가 8000미만인 직원의 관리자 아이디와 급여를 출력하는 쿼리를 작성하세요.
SELECT employee_id , salary
FROM EMPLOYEE
WHERE employee_id IN (
    SELECT manager_id 
    FROM EMPLOYEE
    WHERE salary < 8000
)
ORDER BY employee_id ASC;
'''

'''
+-------------+---------+------+-----+---------+-------+
| Field       | Type    | Null | Key | Default | Extra |
+-------------+---------+------+-----+---------+-------+
| employee_id | int(11) | NO   | PRI | NULL    |       |
| manager_id  | int(11) | YES  |     | NULL    |       |
| salary      | int(11) | NO   |     | NULL    |       |
+-------------+---------+------+-----+---------+-------+
+-------------+------------+--------+
| employee_id | manager_id | salary |
+-------------+------------+--------+
|       10000 |       NULL |   9000 |
|       10001 |       NULL |   8500 |
|       10002 |      10000 |   9000 |
|       10003 |      10002 |   7000 |
|       10004 |      10001 |   9500 |
|       10005 |      10003 |   7500 |
|       10006 |      10003 |   5000 |
+-------------+------------+--------+
+-------------+--------+
| employee_id | salary |
+-------------+--------+
|       10002 |   9000 |
|       10003 |   7000 |
+-------------+--------+
'''

[이론] 반환되는 데이터 형태에 따른 서브쿼리 분류 - 단일 행 서브쿼리

02.반환되는 데이터 형태에 따른 서브쿼리 분류

서브쿼리 분류

1. 단일 행 서브쿼리(Single Row Subquery)

2. 다중 행 서브쿼리(Multi Row Subquery)                    단일 컬럼
---------------------------------------------------
3. 다중 컬럼 서브쿼리(Multi Column Subquery)

단일 행 서브쿼리

서브쿼리의 결과가 한 개의 행을 반환하며,
단일 행 비교 연산자( =, >, <, <=, >=)와 같이 사용된다.

단일 행 서브쿼리

ELICE가 속한 부서의 직원들을 출력한다.

코드
SELECT ID, NAME, SALARY
FROM EMPLOYEE
WHERE DEPARTMENT_ID = (
    SELECT DEPARTMENT_ID
    FROM EMPLOYEE
    WHERE NAME='ELICE');
    
서브쿼리
DEPARTMENT_ID        하나만 반환되기 때문에 :  단일 행 서브쿼리
     1
     
EMPLOYEE 
ID            DEPARTMENT_ID     NAME       SALARY
1000                1           ELICE      12000
1001                2           JESSICA     9000
1002                3           STEVE       7500
1003                1           LINDA       5500
1004                2           DAVID       4400
1005                1           ROBERT      3200

결과
ID            DEPARTMENT_ID     NAME       SALARY
1000                1           ELICE      12000
1003                1           LINDA       5500
1005                1           ROBERT      3200

반환되는 데이터 형태에 따른 서브쿼리 분류 - 단일 행 서브쿼리
REQUEST 테이블에는 요청 ID와 요청상태 정보가 담겨있습니다. 또한 REQUEST_DTL테이블에는 요청 상세 ID, 요청 ID, 요청 이름, 요청 내용 등의 정보가 담겨 있습니다.

요청 상태가 실패(FAILED)인 요청의 상세 정보를 알고자 합니다. 이때, REQUEST 테이블에서 요청상태 값이 실패(FAILED)인 요청 ID가 1개이기 때문에 단일 행 서브쿼리 개념을 이용하여 해당 요청의 상세정보를 조회해 봅시다.

REQUEST 테이블에 있는 요청상태 값이 실패(FAILED)인 요청 ID를 얻어서 그 요청에 대한 상세정보를 알아보는 쿼리를 작성해봅시다.

지시사항
WHERE문을 이용하여, REQUEST 테이블에서 요청상태가 FAILED인 데이터의 요청 ID(request_id)를 출력하는 쿼리를 작성해봅시다.

1번에서 조회한 쿼리를 서브쿼리로 이용하여, REQUEST_DTL 테이블에서 해당 요청 ID에 대한 상세정보(요청 상세 ID(request_dtl_id), 요청 ID(request_id), 요청 이름(request_name), 요청 내용(request_content))를 출력하는 쿼리를 작성해봅시다.

Tip!
데이터 조회순서는 지시사항에서 언급하고 있는 순서대로 정확히 작성하세요.

In [ ]:
'''
-- 아래는 REQUEST, REQUEST_DTL 테이블에 대한 구조를 보여줍니다. 테이블을 수정하실 필요는 없습니다.
DESC REQUEST;
DESC REQUEST_DTL;

SELECT * FROM REQUEST;
SELECT * FROM REQUEST_DTL;
-- 1. 요청상태가 FAILED인 요청 데이터를 조회하는 쿼리를 작성해보세요.
SELECT request_id
FROM REQUEST
WHERE request_status ='FAILED';

-- 2. 위에서 작성한 쿼리를 서브쿼리로 이용하여 REQUEST_DTL 테이블에서 요청 상세를 조회하는 쿼리를 작성해보세요.
SELECT request_dtl_id, request_id, request_name, request_content
FROM REQUEST_DTL
WHERE request_id = (
    SELECT request_id
    FROM REQUEST
    WHERE request_status ='FAILED'
)
ORDER BY request_id ASC;


'''

'''
+----------------+-------------+------+-----+---------+-------+
| Field          | Type        | Null | Key | Default | Extra |
+----------------+-------------+------+-----+---------+-------+
| request_id     | int(11)     | NO   | PRI | NULL    |       |
| request_status | varchar(10) | NO   |     | NULL    |       |
+----------------+-------------+------+-----+---------+-------+
+-----------------+--------------+------+-----+---------+-------+
| Field           | Type         | Null | Key | Default | Extra |
+-----------------+--------------+------+-----+---------+-------+
| request_dtl_id  | int(11)      | NO   | PRI | NULL    |       |
| request_id      | int(11)      | NO   |     | NULL    |       |
| request_name    | varchar(50)  | NO   |     | NULL    |       |
| request_content | varchar(300) | YES  |     | NULL    |       |
+-----------------+--------------+------+-----+---------+-------+
+------------+----------------+
| request_id | request_status |
+------------+----------------+
|      10001 | SUCCESS        |
|      10002 | FAILED         |
|      10003 | SUCCESS        |
|      10004 | SUCCESS        |
+------------+----------------+
+----------------+------------+--------------+-----------------+
| request_dtl_id | request_id | request_name | request_content |
+----------------+------------+--------------+-----------------+
|          21548 |      10001 | FOR_TEST     | NULL            |
|          21567 |      10002 | GET          | FOR GET         |
|          22211 |      10003 | POST         | DATA INPUT      |
|          34527 |      10004 | DB           | DATA INPUT      |
|          36788 |      10005 | HELLO        | NULL            |
+----------------+------------+--------------+-----------------+
+------------+
| request_id |
+------------+
|      10002 |
+------------+
+----------------+------------+--------------+-----------------+
| request_dtl_id | request_id | request_name | request_content |
+----------------+------------+--------------+-----------------+
|          21567 |      10002 | GET          | FOR GET         |
+----------------+------------+--------------+-----------------+
'''

[이론] 반환되는 데이터의 형태에 따른 서브쿼리 분류 - 다중 행 서브쿼리

다중 행 서브쿼리

서브쿼리의 결과가 두 개 이상 행을 반환할 수 있으며,
다중 행 비교 연산자(IN, ALL, ANY, EXISTS)와 같이 사용된다.

다중 행 서브쿼리

- 특징       설명
  IN        서브쿼리 결과에 존재하는 값들 중 하나와 일치해야 한다 
  EXISTS    서브쿼리 결과 값이 존재하는지 여부를 확인한다
  ALL       서브쿼리 결과에 존재하는 모든 값들에 대해 조건을 만족해야 한다
  ANY       서브쿼리 결과에 존재하는 값들 중 조건을 만족하는 것이 하나 이상 존재해야 한다

다중 행 서브쿼리 - IN

영업 또는 개발 팀에 속하는 직원들을 출력한다.


EMPLOYEE 
ID            DEPARTMENT_ID     NAME       SALARY
1000                1           ELICE      12000
1001                2           JESSICA     9000
1002                3           STEVE       7500
1003                1           LINDA       5500
1004                2           DAVID       4400
1005                1           ROBERT      3200

DEPARTMENT
ID       NAME
1        개발
2        품질
3        영업

코드
SELECT NAME
FROM EMPLOYEE
WHERE DEPARTMENT_ID IN (
    SELECT ID
    FROM DEPARTMENT
    WHERE NAME='품질' OR NAME='영업');

서브쿼리 
DEPARTMENT_ID
     2
     3
     
결과
NAME
JESSICA
STEVE
DAVID

다중 행 서브쿼리 - EXISTS

급여가 10000을 넘는 직원이 존재하는 부서에
소속된 모든 직원들을 출력한다

EMPLOYEE
ID           DEPARTMENT_ID      NAME        SALARY
1000               1            ELICE       12000
1001               2            JESSICA      9000
1002               3            STEVE        7500
1003               1            LINDA        5500
1004               2            DAVID        4400
1005               1            ROBERT       3200


코드
SELECT NAME
FROM EMPLOYEE A
WHERE EXISTS (
    SELECT ID
    FROM EMPLOYEE B
    WHERE B.SALARY > 10000 AND
    A.DEPARTMENT_ID = B.DEPARTMENT_ID);
     
    
결과
NAME
ELICE
LINDA
ROBERT

다중 행 서브쿼리 - ALL

개발 팀 소속 모든 직원들 급여보다 급여가 큰 직원들을 출력한다

EMPLOYEE 
ID            DEPARTMENT_ID     NAME       SALARY
1000                1           ELICE      12000
1001                2           JESSICA     9000
1002                3           STEVE       7500
1003                1           LINDA       5500
1004                2           DAVID       4400
1005                1           ROBERT      3200

DEPARTMENT
ID       NAME
1        개발
2        품질
3        영업


코드
SELECT NAME
FROM EMPLOYEE
WHERE SALARY >= ALL(
    SELECT SALARY
    FROM EMPLOYEE
    WHERE DEPARTMENT_ID = 1);
    
서브쿼리
SALARY
12000
 5500         ALL이기 때문에 3가지 조건 모두 만족 하는 ELICE만 출력됨
 3200
 
 결과
 NAME
 ELICE

다중 행 서브쿼리 - ANY

개발팀 소속 임의의 직원들 급여보다 급여가 큰 직원들을 출력한다

EMPLOYEE 
ID            DEPARTMENT_ID     NAME       SALARY
1000                1           ELICE      12000
1001                2           JESSICA     9000
1002                3           STEVE       7500
1003                1           LINDA       5500
1004                2           DAVID       4400
1005                1           ROBERT      3200

DEPARTMENT
ID       NAME
1        개발
2        품질
3        영업

코드
SELECT NAME
FROM EMPLOYEE
WHERE SALARY >= ANY(
    SELECT SALARY
    FROM EMPLOYEE
    WHERE DEPARTMENT_ID = 1);
    

서브쿼리
SALARY
12000
 5500         ANY이기 때문에 가장 작은 값이상이라면 무조건 통과된다
 3200
 
결과
NAME
ELICE
JESSICA
STEVE
LINDA
DAVID
ROBERT

반환되는 데이터 형태에 따른 서브쿼리 분류 - 다중 행 서브쿼리 IN
앞에서 풀었던 문제와 동일하게, REQUEST 테이블에는 요청 ID와 요청상태 정보가 담겨있습니다. 또한 REQUEST_DTL테이블에는 요청 상세 ID, 요청 ID, 요청 이름, 요청 내용 등의 정보가 담겨 있습니다.

이번 문제에서도 REQUEST 테이블에 있는 요청 상태가 실패(FAILED)인 요청 ID를 얻어서 그 요청에 대한 상세정보를 알아보는 쿼리를 작성해봅시다.

다만, 이전 문제와는 다르게 요청상태 값이 실패인 요청 1개가 아니라, 여러 개에 대한 요청 상세 정보를 알아봅니다.


지시사항
앞에서 이용했던 서브쿼리와 같이 요청상태가 FAILED인 요청 ID를 조회하는 쿼리를 이용하여, REQUEST_DTL 테이블에서 해당 요청 ID에 대한 상세정보(요청 상세 ID(request_dtl_id), 요청 ID(request_id), 요청 이름(request_name), 요청 내용(request_content))을 출력하는 쿼리를 작성해봅시다.
이때, 요청상태가 FAILED인 요청 데이터가 2개 이상이기 때문에 IN을 이용해보도록 합니다.

Tips!
결과에 대해 ORDER BY 를 이용하여 요청 상세 ID(request_dtl_id)를 기준으로 오름차순 정렬을 해주세요.
데이터 조회순서는 지시사항에서 언급하고 있는 순서대로 정확히 작성하세요.

In [ ]:
'''
-- 아래는 REQUEST, REQUEST_DTL 테이블에 대한 구조를 보여줍니다. 테이블을 수정하실 필요는 없습니다.
DESC REQUEST;
DESC REQUEST_DTL;

SELECT * FROM REQUEST;
SELECT * FROM REQUEST_DTL;
-- 요청상태가 FAILED인 요청ID를 구하고, 해당 요청들에 대한 요청상세 정보를 조회하는 쿼리를 작성해보세요.
SELECT request_dtl_id, request_id, request_name, request_content
FROM REQUEST_DTL
WHERE request_id IN (
    SELECT request_id
    FROM REQUEST
    WHERE request_status ='FAILED')
ORDER BY request_dtl_id ASC;
'''

'''
+----------------+-------------+------+-----+---------+-------+
| Field          | Type        | Null | Key | Default | Extra |
+----------------+-------------+------+-----+---------+-------+
| request_id     | int(11)     | NO   | PRI | NULL    |       |
| request_status | varchar(10) | NO   |     | NULL    |       |
+----------------+-------------+------+-----+---------+-------+
+-----------------+--------------+------+-----+---------+-------+
| Field           | Type         | Null | Key | Default | Extra |
+-----------------+--------------+------+-----+---------+-------+
| request_dtl_id  | int(11)      | NO   | PRI | NULL    |       |
| request_id      | int(11)      | NO   |     | NULL    |       |
| request_name    | varchar(50)  | NO   |     | NULL    |       |
| request_content | varchar(300) | YES  |     | NULL    |       |
+-----------------+--------------+------+-----+---------+-------+
+------------+----------------+
| request_id | request_status |
+------------+----------------+
|      10001 | SUCCESS        |
|      10002 | FAILED         |
|      10003 | SUCCESS        |
|      10004 | SUCCESS        |
|      10005 | FAILED         |
|      10006 | FAILED         |
+------------+----------------+
+----------------+------------+--------------+-----------------+
| request_dtl_id | request_id | request_name | request_content |
+----------------+------------+--------------+-----------------+
|          21548 |      10001 | FOR_TEST     | NULL            |
|          21567 |      10002 | GET          | FOR GET         |
|          22211 |      10003 | POST         | DATA INPUT      |
|          34527 |      10004 | DB           | DATA INPUT      |
|          36788 |      10005 | HELLO        | NULL            |
|          40015 |      10006 | TEST         | TEST_CONTENT    |
+----------------+------------+--------------+-----------------+
+----------------+------------+--------------+-----------------+
| request_dtl_id | request_id | request_name | request_content |
+----------------+------------+--------------+-----------------+
|          21567 |      10002 | GET          | FOR GET         |
|          36788 |      10005 | HELLO        | NULL            |
|          40015 |      10006 | TEST         | TEST_CONTENT    |
+----------------+------------+--------------+-----------------+
'''

반환되는 데이터 형태에 따른 서브쿼리 분류 - 다중 행 서브쿼리 EXISTS
STORE 테이블에는 가게 ID와 가게 이름 정보가 담겨있습니다. PAYMENT 테이블에는 결제 ID와 가게 ID, 결제금액 정보가 담겨 있습니다.

결제금액이 5,000원 이상인 가게의 가게 ID와 가게 이름을 조회하고자 합니다. 결제금액에 대해서는 PAYMENT 테이블에 있지만, 가게 이름 정보는 STORE 테이블에 있기때문에 다중 행 서브쿼리 EXISTS를 이용하여 PAYMENT 테이블에서 결제금액이 5,000원 이상이고 STORE 테이블의 가게 ID와 일치하는 데이터가 존재하는 경우의 가게 ID와 가게 이름을 조회해 봅시다.

두 개의 테이블을 이용하여, 결제금액이 5,000원 이상인 가게에 대해서, 가게 ID와 가게 이름을 조회하는 쿼리를 작성해봅시다.

지시사항
STORE 테이블을 기준으로 조회하면서 EXISTS문을 응용하여 서브쿼리상에서, PAYMENT 테이블에 대해 STORE 테이블의 가게 ID(store_id)와 일치하고 결제금액이 5,000원 이상인 데이터가 존재하는지를 통해 가게 ID(store_id), 가게 이름(store_name)을 조회하는 쿼리를 작성해보세요.

Tips!
결과에 대해 ORDER BY 를 이용하여 가게 ID를 기준으로 오름차순 정렬을 해주세요.
데이터 조회순서는 지시사항에서 언급하고 있는 순서대로 정확히 작성하세요.

In [ ]:
'''
2
-- 아래는 STORE, PAYMENT 테이블에 대한 구조를 보여줍니다. 테이블을 수정하실 필요는 없습니다.
DESC STORE;
DESC PAYMENT;

SELECT * FROM STORE;
SELECT * FROM PAYMENT;
-- EXISTS문을 응용하여, 결제금액이 5000원 이상인 가게ID, 가게이름을 조회하는 쿼리를 작성해보세요.
SELECT store_id, store_name
FROM STORE AS s
WHERE EXISTS (
    SELECT pay_amount /*어떤 값이 와도 상관 없음*/
    FROM PAYMENT AS p
    WHERE pay_amount >= 5000
    AND p.store_id= s.store_id
)
ORDER BY store_id ASC;
'''




'''
+------------+-------------+------+-----+---------+-------+
| Field      | Type        | Null | Key | Default | Extra |
+------------+-------------+------+-----+---------+-------+
| store_id   | int(11)     | NO   | PRI | NULL    |       |
| store_name | varchar(30) | NO   |     | NULL    |       |
+------------+-------------+------+-----+---------+-------+
+------------+---------+------+-----+---------+-------+
| Field      | Type    | Null | Key | Default | Extra |
+------------+---------+------+-----+---------+-------+
| payment_id | int(11) | NO   | PRI | NULL    |       |
| store_id   | int(11) | NO   |     | NULL    |       |
| pay_amount | int(11) | NO   |     | NULL    |       |
+------------+---------+------+-----+---------+-------+
+----------+------------+
| store_id | store_name |
+----------+------------+
|     1000 | pizza      |
|     1001 | bunsik     |
|     1002 | ice-cream  |
|     1003 | coffee     |
|     1004 | cake       |
+----------+------------+
+------------+----------+------------+
| payment_id | store_id | pay_amount |
+------------+----------+------------+
|      10123 |     1000 |       1000 |
|      10124 |     1002 |       6000 |
|      10125 |     1001 |      10000 |
|      10126 |     1001 |       3000 |
|      10127 |     1003 |       4500 |
|      10128 |     1002 |       5000 |
+------------+----------+------------+
+----------+------------+
| store_id | store_name |
+----------+------------+
|     1001 | bunsik     |
|     1002 | ice-cream  |
+----------+------------+
'''

반환되는 데이터 형태에 따른 서브쿼리 분류 - 다중 행 서브쿼리 ALL
EMPLOYEE 테이블에는 직원 ID, 급여, 직급 정보가 담겨있습니다.

직원들 중에서 모든 사원의 급여보다 급여가 높거나 같은 직원을 조회하려고 합니다. 앞에서 배운 ALL을 이용하여, 모든 사원의 급여보다 크거나 같은 급여에 대한 조건을 작성해 봅시다.

직원들 중 직급이 사원인 모든 직원의 급여를 구한 뒤, ALL을 이용하여 모든 사원들의 급여보다 급여가 높거나 같은 직원을 조회하는 쿼리를 작성해 봅시다.

지시사항
EMPLOYEE테이블에서 직급(position)이 사원인 직원의 급여(salary) 를 조회하는 쿼리를 작성해봅시다.

EMPLOYEE 테이블에 대해, 1번에서 완성한 쿼리와 ALL을 이용하여, 모든 사원들의 급여보다 높거나 같은 급여 를 가진 직원의 직원 ID(employee_id), 급여(salary), 직급(position) 을 조회하는 쿼리를 작성해봅시다.

Tips!
1번 결과에 대해 ORDER BY 를 이용하여 급여를 기준으로 오름차순 정렬을 해주세요.
2번 결과에 대해 ORDER BY 를 이용하여 직원 ID를 기준으로 오름차순 정렬을 해주세요.
데이터 조회순서는 지시사항에서 언급하고 있는 순서대로 정확히 작성하세요.

In [ ]:
'''
-- 아래는 EMPLOYEE 테이블에 대한 구조를 보여줍니다. 테이블을 수정하실 필요는 없습니다.
DESC EMPLOYEE;

SELECT * FROM EMPLOYEE;
-- 1. 직급이 '사원'인 직원의 급여를 조회하는 쿼리를 작성해봅시다.
SELECT salary 
FROM EMPLOYEE
WHERE POSITION = '사원'
ORDER BY salary ASC;

-- 2. 앞에서 작성한 쿼리와 ALL을 이용하여, 모든 사원들의 급여보다 높거나 같은 급여를 가진 직원을 조회하는 쿼리를 작성해봅시다.
SELECT employee_id, salary, position
FROM EMPLOYEE
WHERE salary >= ALL(
    SELECT salary 
    FROM EMPLOYEE
    WHERE POSITION = '사원'
)
ORDER BY employee_id ASC;
'''
'''
+-------------+-------------+------+-----+---------+-------+
| Field       | Type        | Null | Key | Default | Extra |
+-------------+-------------+------+-----+---------+-------+
| employee_id | int(11)     | NO   | PRI | NULL    |       |
| salary      | int(11)     | NO   |     | NULL    |       |
| position    | varchar(10) | NO   |     | NULL    |       |
+-------------+-------------+------+-----+---------+-------+
+-------------+--------+----------+
| employee_id | salary | position |
+-------------+--------+----------+
|       10000 |   9000 | 사장     |
|       10001 |   8000 | 부장     |
|       10002 |   7800 | 과장     |
|       10003 |   7500 | 과장     |
|       10004 |   6800 | 대리     |
|       10005 |   7000 | 대리     |
|       10006 |   6000 | 대리     |
|       10007 |   5500 | 사원     |
|       10008 |   4500 | 사원     |
|       10009 |   7000 | 사원     |
+-------------+--------+----------+
+--------+
| salary |
+--------+
|   4500 |
|   5500 |
|   7000 |
+--------+
+-------------+--------+----------+
| employee_id | salary | position |
+-------------+--------+----------+
|       10000 |   9000 | 사장     |
|       10001 |   8000 | 부장     |
|       10002 |   7800 | 과장     |
|       10003 |   7500 | 과장     |
|       10005 |   7000 | 대리     |
|       10009 |   7000 | 사원     |
+-------------+--------+----------+
'''

반환되는 데이터 형태에 따른 서브쿼리 분류 - 다중 행 서브쿼리 ANY
FOOD 테이블에는 음식 ID, 음식 타입, 음식 이름, 가격 정보가 담겨 있습니다.

음식 중에서 임의의 Main 음식보다 가격이 비싼 음식을 조회하고자 합니다. 앞에서 배운 ANY를 이용하여 음식의 가격이 임의의 Main 음식보다 가격이 비싼지에 대한 조건을 작성해 봅시다.

음식 중에서 음식 타입이 Main인 음식들의 가격을 구한 뒤, ANY를 이용하여 임의의 Main 음식보다 가격이 비싼 음식들에 대해서 조회하는 쿼리를 작성해 봅시다.

지시사항
FOOD테이블에서 음식 타입(food_type)이 Main인 임의(ANY)의 음식 가격(price) 보다 가격이 비싼 음식들의 음식 ID(food_id), 음식 타입(food_type), 음식 이름(food_name), 가격(price) 을 조회하는 쿼리를 작성해봅시다.

Tips!
결과에 대해 ORDER BY 를 이용하여 음식 ID를 기준으로 오름차순 정렬을 해주세요.
데이터 조회순서는 지시사항에서 언급하고 있는 순서대로 정확히 작성하세요.

In [ ]:
'''
-- 아래는 FOOD 테이블에 대한 구조를 보여줍니다. 테이블을 수정하실 필요는 없습니다.
DESC FOOD;
SELECT * FROM FOOD;
-- 음식타입이 Main인 임의의 음식의 가격보다 비싼 음식들을 조회해봅시다.
SELECT food_id, food_type, food_name, price
FROM FOOD
WHERE price > ANY(
    SELECT price
    FROM FOOD
    WHERE food_type ='Main'
)
ORDER BY food_id ASC;
'''

'''
+-----------+--------------+------+-----+---------+-------+
| Field     | Type         | Null | Key | Default | Extra |
+-----------+--------------+------+-----+---------+-------+
| food_id   | int(11)      | NO   | PRI | NULL    |       |
| food_type | varchar(30)  | NO   |     | NULL    |       |
| food_name | varchar(100) | NO   |     | NULL    |       |
| price     | int(11)      | YES  |     | NULL    |       |
+-----------+--------------+------+-----+---------+-------+
+---------+-----------+-----------+-------+
| food_id | food_type | food_name | price |
+---------+-----------+-----------+-------+
|       1 | Appetizer | Salad     |  5000 |
|       2 | Appetizer | Soup      |  3500 |
|       3 | Main      | Pasta     |  8000 |
|       4 | Main      | Steak     | 11000 |
|       5 | Main      | rice      |  7000 |
|       6 | Dessert   | Ice-cream | 10000 |
|       7 | Dessert   | Cookie    |  5000 |
|       8 | Dessert   | Coffee    |  8000 |
+---------+-----------+-----------+-------+
+---------+-----------+-----------+-------+
| food_id | food_type | food_name | price |
+---------+-----------+-----------+-------+
|       3 | Main      | Pasta     |  8000 |
|       4 | Main      | Steak     | 11000 |
|       6 | Dessert   | Ice-cream | 10000 |
|       8 | Dessert   | Coffee    |  8000 |
+---------+-----------+-----------+-------+
'''

[이론] 반환되는 데이터 형태에 따른 서브쿼리 분류 - 다중 컬럼 서브쿼리

다중 컬럼 서브쿼리

서브쿼리의 결과가 여러 개의 컬럼을 반환하며,
메인쿼리의 조건과 동시에 비교된다.

다중 컬럼 서브쿼리

각 부서에서 가장 높은 급여를 받는 직원의 이름과 급여를 출력

코드 
SELECT NAME SALARY
FROM EMPLOYEE
WHERE (DEPARTMENT_ID, SALARY) IN (
    SELECT DEPARTMENT_ID, MAX(SALARY)
    FROM EMPLOYEE
    GROUP BY DEPARTMENT_ID);
    
    
EMPLOYEE
ID          DEPARTMENT_ID        NAME         SALARY
1000            1                ELICE        12000
1001            2                JESSICA       9000
1002            3                STEVE         7500
1003            1                LINDA         5500
1004            2                DAVID         4400
1005            1                ROBERT        3200


서브쿼리
DEPARTMENT_ID   SALARY
      1          12000
      2           9000
      3           7500
      
결과
ID          DEPARTMENT_ID        NAME         SALARY
1000            1                ELICE        12000
1001            2                JESSICA       9000
1002            3                STEVE         7500

반환되는 데이터 형태에 따른 서브쿼리 분류 - 다중 컬럼 서브쿼리
BOOK 테이블에는 책 ID, 책 이름, 책 작가, 가격 정보가 담겨있으며, BOOK_STOCK 테이블에는 재고 ID, 책 이름, 책 작가, 재고 수량 정보가 담겨 있습니다.

재고가 남아있는 책에 대해서 책 ID, 책 이름, 책 작가, 가격을 조회하고자 합니다. BOOK_STOCK를 통해 재고가 1이상인 책의 정보를 얻어서, BOOK 테이블에서 해당 책의 정보를 조회합니다. 하지만 BOOK 테이블에 작가가 다르지만 책 이름이 동일한 경우가 있을 수 있으니, 책 이름과 책 작가, 2가지를 비교하여 정보를 조회하도록 합시다.

BOOK_STOCK 테이블에서 재고 수량(stock)이 1 이상인 데이터의 책 제목(book_name), 책 작가(book_writer) 를 추출하고 해당 데이터에 대해 BOOK 테이블과 IN을 활용하여 책 ID(book_id), 책 이름(book_name), 책 작가(book_writer), 가격(price) 을 조회하는 쿼리를 작성해봅시다.

지시사항
BOOK_STOCK테이블에서 재고(stock)가 1 이상인 데이터의 책 제목(book_name), 책 작가(book_writer) 를 조회하는 서브쿼리를 만들고, 이를 BOOK테이블에 WHERE와 IN을 이용해 책 ID(book_id), 책 제목(book_name), 책 작가(book_writer), 가격(price) 을 조회하는 쿼리를 작성해봅시다.

Tips!
결과에 대해 ORDER BY 를 이용하여 책 ID를 기준으로 오름차순 정렬을 해주세요.
데이터 조회순서는 지시사항에서 언급하고 있는 순서대로 정확히 작성하세요.

In [ ]:
'''
-- 아래는 BOOK, BOOK_STOCK 테이블에 대한 구조를 보여줍니다. 테이블을 수정하실 필요는 없습니다.
DESC BOOK;
DESC BOOK_STOCK;

SELECT * FROM BOOK;
SELECT * FROM BOOK_STOCK;
-- BOOK_STOCK 테이블에서 재고가 1이상인 데이터의 책이름, 책작가 정보를 조회후, BOOK테이블에 IN을 활용하여 조회하는 쿼리를 작성해봅시다.

SELECT book_id, book_name, book_writer, price
FROM BOOK
WHERE (book_name, book_writer) IN (
select book_name, book_writer
FROM BOOK_STOCK
WHERE stock >= 1
)
ORDER BY book_id ASC;
'''

'''
+-------------+--------------+------+-----+---------+-------+
| Field       | Type         | Null | Key | Default | Extra |
+-------------+--------------+------+-----+---------+-------+
| book_id     | int(11)      | NO   | PRI | NULL    |       |
| book_name   | varchar(100) | NO   |     | NULL    |       |
| book_writer | varchar(100) | NO   |     | NULL    |       |
| price       | int(11)      | NO   |     | NULL    |       |
+-------------+--------------+------+-----+---------+-------+
+-------------+--------------+------+-----+---------+-------+
| Field       | Type         | Null | Key | Default | Extra |
+-------------+--------------+------+-----+---------+-------+
| stock_id    | int(11)      | NO   | PRI | NULL    |       |
| book_name   | varchar(100) | NO   |     | NULL    |       |
| book_writer | varchar(100) | NO   |     | NULL    |       |
| stock       | int(11)      | NO   |     | NULL    |       |
+-------------+--------------+------+-----+---------+-------+
+---------+--------------+-------------+-------+
| book_id | book_name    | book_writer | price |
+---------+--------------+-------------+-------+
|       1 | Hello SQL    | Elice       | 10000 |
|       2 | Hello JAVA   | KIM         | 20000 |
|       3 | Hello PYTHON | MOON        | 15000 |
|       4 | Hello SERVER | SONG        | 30000 |
+---------+--------------+-------------+-------+
+----------+--------------+-------------+-------+
| stock_id | book_name    | book_writer | stock |
+----------+--------------+-------------+-------+
|     1001 | Hello SQL    | Elice       |     0 |
|     1002 | Hello JAVA   | KIM         |     2 |
|     1003 | Hello PYTHON | MOON        |     3 |
|     1004 | Hello SERVER | SONG        |     0 |
+----------+--------------+-------------+-------+
+---------+--------------+-------------+-------+
| book_id | book_name    | book_writer | price |
+---------+--------------+-------------+-------+
|       2 | Hello JAVA   | KIM         | 20000 |
|       3 | Hello PYTHON | MOON        | 15000 |
+---------+--------------+-------------+-------+
'''

[이론] 스칼라 서브쿼리

스칼라 서브쿼리

스칼라 서브쿼리는
하나의 속성을 가지면서, 하나의 행만을 반환하는 쿼리이다.
그리고 이는 SELECT,WHERE,HAVING절 등에서 사용할 수 있다.

스칼라 서브쿼리 예시

부서명과 부서의 구성원 수를 출력한다

코드
SELECT NAME, (
    SELECT COUNT(*)
    FROM EMPLOYEE E
    WHERE E.DEPARTMENT_ID = D.ID)
FROM DEPARTMENT D;

EMPLOYEE
ID          DEPARTMENT_ID        NAME         SALARY
1000            1                ELICE        12000
1001            2                JESSICA       9000
1002            3                STEVE         7500
1003            1                LINDA         5500
1004            2                DAVID         4400
1005            1                ROBERT        3200

DEPARTMENT
ID       NAME
1        개발
2        품질
3        영업


서브쿼리
DEPARTMENT_ID COUNT(*)
      1           3
      2           2
      3           1
      

결과
NAME   COUNT(*)
개발     3
품질     2
영업     1

스칼라 서브쿼리 예시 - DUAL

FROM을 사용한 특정 테이블 참조 없이 쿼리를 작성하는 경우도 있다.
전체 임직원 중에 팀장 직급이 차지하는 비율을 출력한다.

코드
SELECT 
    (SELECT COUNT(*) FROM EMPLOYEE WHERE DEPARTMENT_ID = 1 ) /
    (SELECT COUNT(*) FROM EMPLOYEE) 
    AS DEVELOPER_RATIO
FROM DUAL;

EMPLOYEE
ID          DEPARTMENT_ID        NAME         SALARY
1000            1                ELICE        12000
1001            2                JESSICA       9000
1002            3                STEVE         7500
1003            1                LINDA         5500
1004            2                DAVID         4400
1005            1                ROBERT        3200

 결과
 DEVELOPER_RATIO
       0.5

스칼라 서브쿼리
LECTURE 테이블에는 강의 ID, 강의 이름, 강의 타입 ID 정보가 담겨 있고, LECTURE_TYPE 테이블에는 타입 ID, 타입 이름 정보가 담겨 있습니다.

LECTURE_TYPE 테이블에 있는 각 강의 타입들에 대해서 몇 개의 강의들이 존재하는지 조회하려고 합니다.
각 강의 타입의 정보와, 해당 하는 타입에 대한 강의 개수를 조회하기 위해서 스칼라 서브쿼리를 이용해 봅시다.

LECTURE 테이블의 강의 타입 ID(lecture_type_id) 를 이용하여, LECTURE_TYPE 테이블에 대해서 타입 ID(type_id), 타입 이름(type_name), 타입에 해당하는 강의 개수를 조회하는 쿼리를 작성해봅시다.

지시사항
LECTURE_TYPE 테이블에 대해, 타입 ID(type_id), 타입 이름(type_name), 타입별 강의 개수를 조회하는 쿼리를 작성하세요.
이때, LECTURE 테이블과 COUNT를 응용하여 강의 타입 ID(lecture_type_id)와 타입 ID(type_id) 가 일치하는 조건으로, 타입별 강의 개수를 구하는 서브쿼리를 만들어야 합니다.

Tips!
결과에 대해 ORDER BY 를 이용하여 타입 ID를 기준으로 오름차순 정렬을 해주세요.
데이터 조회순서는 지시사항에서 언급하고 있는 순서대로 정확히 작성하세요.

In [ ]:
'''
-- 아래는 LECTURE, LECTURE_TYPE 테이블에 대한 구조를 보여줍니다. 테이블을 수정하실 필요는 없습니다.
DESC LECTURE;
DESC LECTURE_TYPE;

SELECT * FROM LECTURE;
SELECT * FROM LECTURE_TYPE;
-- 타입ID, 타입이름, 타입에 해당하는 강의의 수를 조회하는 쿼리를 작성해봅시다.
SELECT type_id, type_name,
    (SELECT COUNT(*) 
    FROM LECTURE AS l
    WHERE l.lecture_type_id = t.type_id) AS lecture_number
FROM LECTURE_TYPE AS t
ORDER BY type_id ASC;
'''
#
'''
+-----------------+-------------+------+-----+---------+-------+
| Field           | Type        | Null | Key | Default | Extra |
+-----------------+-------------+------+-----+---------+-------+
| lecture_id      | int(11)     | NO   | PRI | NULL    |       |
| lecture_name    | varchar(30) | NO   |     | NULL    |       |
| lecture_type_id | int(11)     | NO   |     | NULL    |       |
+-----------------+-------------+------+-----+---------+-------+
+-----------+-------------+------+-----+---------+-------+
| Field     | Type        | Null | Key | Default | Extra |
+-----------+-------------+------+-----+---------+-------+
| type_id   | int(11)     | NO   | PRI | NULL    |       |
| type_name | varchar(30) | NO   |     | NULL    |       |
+-----------+-------------+------+-----+---------+-------+
+------------+--------------+-----------------+
| lecture_id | lecture_name | lecture_type_id |
+------------+--------------+-----------------+
|          1 | SQL          |               3 |
|          2 | Network      |               1 |
|          3 | NoSQL        |               3 |
|          4 | UI/UX        |               2 |
|          5 | API          |               1 |
+------------+--------------+-----------------+
+---------+-----------+
| type_id | type_name |
+---------+-----------+
|       1 | Back-end  |
|       2 | Front-end |
|       3 | Database  |
+---------+-----------+
+---------+-----------+----------------+
| type_id | type_name | lecture_number |
+---------+-----------+----------------+
|       1 | Back-end  |              2 |
|       2 | Front-end |              1 |
|       3 | Database  |              2 |
+---------+-----------+----------------+
'''

[이론] 뷰

04.뷰

VIEW

뷰는 다른 테이블에서 파생된 테이블이다.
물리적으로 데이터가 저장되는 것이 아니라,
논리적으로만 존재하며 뷰를 사용한 질의 시에는
DBMS에서 뷰 정의에 따라 질의를 재작성하여 수행한다

VIEW의 장점

특징

1. 독립성   
- 테이블 구조가 변경되어도 뷰를 사용하고 있는 응용 프로그램은 변경하지 않아도 된다

2. 편리성
- 자주 사용되는 복잡한 쿼리를 미리 뷰로 정의해 놓으면, 
  추후 쿼리는 간단한 형태로 표현할수 있다
  
3. 보안성
- 사용자의 권한에 따라 열람 가능한 데이터를 다르게 할 수 있다
  권한에 따라 확인 가능한 컬럼을 정의하여 뷰를 생성하면,
  기본 테이블 노출 없이 접근 제어를 할 수 있다

VIEW의 특징

- 생성된 뷰는 또 다른 뷰를 생성하는데 사용될 수 있다

- 뷰의 정의는 변경할 수 없으며, 삭제 후 재생성이 필요하다

- 뷰를 통한 갱신에는 제약이 따른다
  갱신을 위해서는 기본적으로 원천 테이블의 기본키가 포함되어야 한다

- 원천이 되는 테이블이나 뷰가 삭제되면 이를 기반으로 하는 뷰도 함께 삭제된다

VIEW 정의 쿼리

Expression
CREATE [OR REPLACE] VIEW view_name AS
    - 같은 이름의 뷰가 존재하면 기존 뷰를 무시하고 대체
SELECT column1, colum2 ...      |
FROM table_name                 |  - 뷰를 생성할 쿼리 구문
WHERE condition;                |

VIEW의 정의 쿼리

EMPLOYEE
ID          DEPARTMENT_ID        NAME         SALARY
1000            1                ELICE        12000
1001            2                JESSICA       9000
1002            3                STEVE         7500
1003            1                LINDA         5500
1004            2                DAVID         4400
1005            1                ROBERT        3200

DEPARTMENT
ID       NAME
1        개발
2        품질
3        영업

코드
CREATE VIEW EMPLOYEE_FULL AS
(
    SELECT
        E.ID AS EMPLOYEE_ID,
        E.NAME AS EMPLOYEE_NAME,
        E.SALARY,
        E.DEPART_MENT_ID,
        D.NAME AS DEPARTMENT_NAME
    FROM
       EMPOLEE E
    LEFT OUTER JOIN
       DEPARTMENT D
    ON
       E.DEPARTMENT_ID = D.ID
);

SELECT * FROM EMPLOYEE_FULL;

ID     NAME    ASLARY   DEPARTMENT_ID    DEPARTMENT_NAME
1000   ELICE   12000          1                개발
1001   JESSICA  9000          2                품질
1002   STEVE    7500          3                영업
1003   LINDA    5500          1                개발
1004   DAVID    4400          2                품질
1005   ROBERT   3200          1                개발

뷰
EMPLOYEE 테이블에는 직원 ID, 부서 이름, 급여 정보가 담겨있습니다.

업무 상 부서이름이 ‘개발’인 직원들의 정보만 조회하는 경우가 빈번하여, 해당 직원들에 대한 뷰를 별도로 만들고자 합니다.

EMPLOYEE 테이블을 이용하여 부서 이름이 ‘개발’인 직원들의 직원 ID, 급여 정보를 가진 뷰(EMPLOYEE_DEV) 를 만드는 쿼리를 작성해봅시다.




지시사항
EMPLOYEE테이블에서 부서 이름(department_name)이 ‘개발’ 인 직원들의 직원 ID(employee_id), 급여(salary) 정보를 가지는 EMPLOYEE_DEV 뷰(View) 를 만드는 쿼리를 작성해봅시다.

1번에서 만든 EMPLOYEE_DEV 뷰에 대하여 뷰의 모든 데이터를 출력하는 쿼리를 작성하세요.

Tip!
데이터 조회 및 생성순서는 지시사항에서 언급하고 있는 순서대로 정확히 작성하세요.

In [ ]:
'''
-- 아래는 EMPLOYEE 테이블에 대한 구조를 보여줍니다. 테이블을 수정하실 필요는 없습니다.
DESC EMPLOYEE;

SELECT * FROM EMPLOYEE;
-- 1. 부서이름이 '개발'인 직원의 직원ID, 급여 정보를 가지는 뷰(EMPLOYEE_DEV)를 만드는 쿼리를 작성해봅시다.
CREATE VIEW EMPLOYEE_DEV AS(
    SELECT department_name, employee_id, salary 
    FROM EMPLOYEE 
    WHERE department_name ='개발'
    );

-- 2. 위에서 만든 뷰(EMPLOYEE_DEV)의 모든 데이터를 조회하는 쿼리를 작성해봅시다.
SELECT * FROM EMPLOYEE_DEV;

'''

'''
+-----------------+-------------+------+-----+---------+-------+
| Field           | Type        | Null | Key | Default | Extra |
+-----------------+-------------+------+-----+---------+-------+
| employee_id     | int(11)     | NO   | PRI | NULL    |       |
| department_name | varchar(30) | NO   |     | NULL    |       |
| salary          | int(11)     | NO   |     | NULL    |       |
+-----------------+-------------+------+-----+---------+-------+
+-------------+-----------------+--------+
| employee_id | department_name | salary |
+-------------+-----------------+--------+
|       10000 | 영업            |   9000 |
|       10001 | 개발            |   8500 |
|       10002 | 개발            |   9000 |
|       10003 | 운영            |   7000 |
|       10004 | 기획            |   9500 |
|       10005 | 사업            |   7500 |
|       10006 | 영업            |   6000 |
|       10007 | 기획            |  10000 |
|       10008 | 사업            |   8000 |
|       10009 | 개발            |   9000 |
|       10010 | 개발            |   7500 |
+-------------+-----------------+--------+
+-----------------+-------------+--------+
| department_name | employee_id | salary |
+-----------------+-------------+--------+
| 개발            |       10001 |   8500 |
| 개발            |       10002 |   9000 |
| 개발            |       10009 |   9000 |
| 개발            |       10010 |   7500 |
+-----------------+-------------+--------+
'''

서브쿼리 심화
서브쿼리 심화 수업도 끝이 났어요! 
심화 과정인 만큼 이번 장에는 어려운 내용이 많았어요.
이럴 땐 뭐다? 복습! 이번 장의 내용을 꼼꼼히 훑어보고 마지막 장으로 넘어가요~



1. 동작하는 방식에 따른 서브쿼리 분류
Point I
연관 서브쿼리: 메인쿼리의 컬럼이 서브쿼리에 포함되며, 메인쿼리의 컬럼은 서브쿼리에 특정 조건으로 사용

SELECT ID, DEPARTMENT_ID, NAME, SALARY
FROM EMPLOYEE A
WHERE SALARY > (
    SELECT AVG(SALARY)
    FROM EMPLOYEE B
    WHERE B.DEPARTMENT_ID = A.DEPARTMENT_ID);
본인이 속한 부서의 평균 급여보다 높은 급여를 받는 직원들 출력
Point II
비연관 서브쿼리: 메인쿼리 컬럼이 서브쿼리에 포함되지 않으며, 주로 메인쿼리에 특정한 값을 제공할 때 사용

SELECT AVG(SALARY)
FROM EMPLOYEE
WHERE DEPARTMENT_ID = (
    SELECT DEPARTMENT_ID
    FROM EMPLOYEE
    WHERE NAME = 'ELICE');
ELICE가 속한 부서의 평균 급여 출력


2. 반환되는 데이터 형태에 따른 서브쿼리 분류
Point I
단일 행 서브쿼리: 서브쿼리의 결과가 한 개의 행을 반환하며, 단일 행 비교 연산자(=, <, >, <=, >=)와 같이 사용

SELECT ID, NAME, SALARY
FROM EMPLOYEE
WHERE DEPARTMENT_ID = (
    SELECT DEPARTMENT_ID
    FROM EMPLOYEE
    WHERE NAME = 'ELICE');
ELICE가 속한 부서의 직원들을 출력
서브쿼리가 DEPARTMENT_ID = 1을 반환
Point II
다중 행 서브쿼리: 서브쿼리의 결과가 두 개 이상의 행을 반환하며, 다중 행 비교 연산자(IN, ALL, ANY, EXISTS)와 같이 사용

IN: 서브쿼리 결과에 존재하는 값들 중 하나와 일치하는 경우

SELECT NAME FROM EMPLOYEE
WHERE DEPARTMENT_ID IN (
    SELECT ID
    FROM DEPARTMENT
    WHERE NAME = '품질' OR NAME = '영업');
품질 또는 영업 팀에 속하는 직원들을 출력
EXISTS: 서브쿼리 결과 값이 존재하는지 확인

SELECT NAME FROM EMPLOYEE A
WHERE EXISTS (
    SELECT ID
    FROM EMPLOYEE B
    WHERE B.SALARY >= 10000
        AND A.DEPARTMENT_ID = B.DEPARTMENT_ID);
급여가 10000을 넘는 직원이 존재하는 부서에 소속된 모든 직원들을 출력
ALL: 서브쿼리 결과에 존재하는 모든 값들에 대해 조건을 만족하는 경우

SELECT NAME FROM EMPLOYEE
WHERE SALARY >= ALL (
    SELECT SALARY
    FROM EMPLOYEE
    WHERE DEPARTMENT_ID = 1);
개발팀(DEPARTMENT_ID = 1) 소속 모든 직원들 급여보다 급여가 큰 직원들을 출력
ANY: 서브쿼리 결과에 존재하는 값들 중 조건을 만족하는 것이 하나 이상 존재하는 경우

SELECT NAME FROM EMPLOYEE
WHERE SALARY >= ANY (
    SELECT SALARY
    FROM EMPLOYEE
    WHERE DEPARTMENT_ID = 1);
개발팀 소속 임의의 직원 급여보다 급여가 큰 직원들을 출력
Point III
다중 컬럼 서브쿼리: 서브쿼리의 결과가 여러 개의 컬럼을 반환하며, 메인쿼리의 조건과 동시에 비교

SELECT NAME, SALARY
FROM EMPLOYEE
WHERE (DEPARTMENT_ID) IN (
    SELECT DEPARTMENT_ID, MAX(SALARY)
    FROM EMPLOYEE
    GROUP BY DEPARTMENT_ID);
각 부서에서 가장 높은 급여를 받는 직원의 이름과 급여 출력


3. 스칼라 서브쿼리
Point I
스칼라 서브쿼리는 하나의 속성을 가지면서 하나의 행만 반환하는 쿼리입니다. 이는 SELECT, WHERE, HAVING 절 등에서 사용 가능합니다.

SELECT NAME, (
    SELECT COUNT(*)
    FROM EMPLOYEE E
    WHERE E.DEPARTMENT_ID = D.ID)
FROM DEPARTMENT D;
부서명과 부서의 구성원 수를 출력
Point II
DUAL 예시

SELECT
    (SELECT COUNT(*) FROM EMPLOYEE WHERE DEPARTMENT_ID = 1) /
    (SELECT COUNT(*) FROM EMPLOYEE)
    AS DEVELOPER_RATIO
FROM DUAL;
FROM을 사용한 특정 테이블 참조 없이 쿼리 작성 가능
전체 임직원 중 팀장 직급이 차지하는 비율 출력


4. 뷰
뷰는 다른 테이블에서 파생된 테이블입니다. 물리적으로 데이터가 저장되는 것이 아니라, 논리적으로만 존재하며 뷰를 사용한 질의 시에는 DBMS에서 뷰 정의에 따라 질의를 재작성하여 수행합니다.

Point I
VIEW의 장점

독립성: 테이블 구조가 변경되어도 뷰를 사용하고 있는 응용 프로그램은 변경하지 않아도 됩니다.
편리성: 자주 사용되는 복잡한 쿼리를 미리 뷰로 정의해 놓으면, 추후 쿼리는 간단한 형태로 표현할 수 있습니다.
보안성: 사용자의 권한에 따라 열람 가능한 데이터를 다르게 할 수도 있습니다.
Point II
VIEW의 특징

생성된 뷰는 또 다른 뷰를 생성하는데 사용될 수 있습니다.
뷰의 정의는 변경할 수 없으며, 삭제 후에는 재생성이 필요합니다.
뷰를 통한 갱신을 위해서는 원천 테이블의 기본키가 포함되어야 합니다.
원천이 되는 테이블이나 뷰가 삭제되면 이를 기반으로 하는 뷰도 함께 삭제 됩니다.
Point III
VIEW 정의 쿼리 예시

CREATE VIEW EMPLOYEE_FULL AS --같은 이름의 뷰가 존재하면 기존 뷰를 무시하고 대체
( --뷰를 생성할 쿼리 구문
    SELECT
        E.ID AS EMPLOYEE_ID,
        E.NAME AS EMPLOYEE_NAME,
        E.SALARY,
        E.DEPARTMENT_ID,
        D.NAME AS DEPARTMENT_NAME
    FROM EMPLOYEE E
    LEFT OUTER JOIN DEPARTMENT D
    ON E.DEPARTMENT_ID = D.ID
);